spec/cassettes/event_payment_intent_succeeded_checkout.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/checkout/sessions?payment_intent=pi_3QKRKvElA4InVgv81SMzUj1j
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/13.1.1
      Authorization:
      - "<BEARER_TOKEN>"
      Stripe-Version:
      - 2024-10-28.acacia
      X-Stripe-Client-User-Agent:
      - "<X_STRIPE_CLIENT_USER_AGENT>"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 Nov 2024 23:10:22 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3260'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fcheckout%2Fsessions; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report"
      Request-Id:
      - req_M8kiFgVQlDrnmZ
      Stripe-Version:
      - 2024-10-28.acacia
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - A
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "cs_test_a1BBn4RW1sExgdMOA3yk7xvFVn2XGfONbOZsy0h6Up4CROhQKSYxcLJ49U",
              "object": "checkout.session",
              "adaptive_pricing": {
                "enabled": false
              },
              "after_expiration": null,
              "allow_promotion_codes": null,
              "amount_subtotal": 300,
              "amount_total": 300,
              "automatic_tax": {
                "enabled": false,
                "liability": null,
                "status": null
              },
              "billing_address_collection": "auto",
              "cancel_url": "http://localhost:3000/order",
              "client_reference_id": null,
              "client_secret": null,
              "consent": null,
              "consent_collection": null,
              "created": 1731445756,
              "currency": "usd",
              "currency_conversion": null,
              "custom_fields": [],
              "custom_text": {
                "after_submit": null,
                "shipping_address": null,
                "submit": null,
                "terms_of_service_acceptance": null
              },
              "customer": "cus_RCb5X2SQYOwAKG",
              "customer_creation": null,
              "customer_details": {
                "address": {
                  "city": "San Francisco",
                  "country": "USA",
                  "line1": "123 Main St",
                  "line2": "Apt 567",
                  "postal_code": "12355",
                  "state": "UT"
                },
                "email": "dairytest@test.com",
                "name": "Dairy Test",
                "phone": null,
                "tax_exempt": "none",
                "tax_ids": []
              },
              "customer_email": null,
              "expires_at": 1731532156,
              "invoice": null,
              "invoice_creation": {
                "enabled": false,
                "invoice_data": {
                  "account_tax_ids": null,
                  "custom_fields": null,
                  "description": null,
                  "footer": null,
                  "issuer": null,
                  "metadata": {},
                  "rendering_options": null
                }
              },
              "livemode": false,
              "locale": null,
              "metadata": {},
              "mode": "payment",
              "payment_intent": "pi_3QKRKvElA4InVgv81SMzUj1j",
              "payment_link": null,
              "payment_method_collection": "if_required",
              "payment_method_configuration_details": {
                "id": "pmc_1QKI6xElA4InVgv8AaZ4UKa9",
                "parent": null
              },
              "payment_method_options": {
                "card": {
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card",
                "link",
                "cashapp",
                "amazon_pay"
              ],
              "payment_status": "paid",
              "phone_number_collection": {
                "enabled": false
              },
              "recovered_from": null,
              "saved_payment_method_options": {
                "allow_redisplay_filters": [
                  "always"
                ],
                "payment_method_remove": null,
                "payment_method_save": "enabled"
              },
              "setup_intent": null,
              "shipping_address_collection": null,
              "shipping_cost": null,
              "shipping_details": null,
              "shipping_options": [],
              "status": "complete",
              "submit_type": null,
              "subscription": null,
              "success_url": "http://localhost:3000/success",
              "total_details": {
                "amount_discount": 0,
                "amount_shipping": 0,
                "amount_tax": 0
              },
              "ui_mode": "hosted",
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/checkout/sessions"
        }
  recorded_at: Wed, 13 Nov 2024 23:10:21 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/checkout/sessions/cs_test_a1BBn4RW1sExgdMOA3yk7xvFVn2XGfONbOZsy0h6Up4CROhQKSYxcLJ49U/line_items
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/13.1.1
      Authorization:
      - "<BEARER_TOKEN>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_M8kiFgVQlDrnmZ","request_duration_ms":280}}'
      Stripe-Version:
      - 2024-10-28.acacia
      X-Stripe-Client-User-Agent:
      - "<X_STRIPE_CLIENT_USER_AGENT>"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 Nov 2024 23:10:22 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1089'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fcheckout%2Fsessions%2F%3Asession%2Fline_items;
        block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action
        'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample';
        style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report"
      Request-Id:
      - req_DIwaS9f90CHCLs
      Stripe-Version:
      - 2024-10-28.acacia
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - A
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "li_1QKRKqElA4InVgv8Y7FdR1Rz",
              "object": "item",
              "amount_discount": 0,
              "amount_subtotal": 300,
              "amount_tax": 0,
              "amount_total": 300,
              "currency": "usd",
              "description": "Mixed Berry Smoothie (Water base)",
              "price": {
                "id": "price_1QG44XElA4InVgv8dOnqfhyu",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1730403021,
                "currency": "usd",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_R8KkVOibvpRPlc",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 300,
                "unit_amount_decimal": "300"
              },
              "quantity": 1
            }
          ],
          "has_more": false,
          "url": "/v1/checkout/sessions/cs_test_a1BBn4RW1sExgdMOA3yk7xvFVn2XGfONbOZsy0h6Up4CROhQKSYxcLJ49U/line_items"
        }
  recorded_at: Wed, 13 Nov 2024 23:10:21 GMT
recorded_with: VCR 6.3.1
