spec/fixtures/stripe/event_payment_intent_succeeded.json

{
  "id": "evt_3QKRKvElA4InVgv81fQKuWwq",
  "object": "event",
  "api_version": "2024-10-28.acacia",
  "created": 1731445762,
  "data": {
    "object": {
      "id": "pi_3QKRKvElA4InVgv81SMzUj1j",
      "object": "payment_intent",
      "amount": 300,
      "amount_capturable": 0,
      "amount_details": { "tip": {} },
      "amount_received": 300,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic_async",
      "client_secret": "<REDACTED>",
      "confirmation_method": "automatic",
      "created": 1731445761,
      "currency": "usd",
      "customer": "cus_RCb5X2SQYOwAKG",
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "latest_charge": "ch_3QKRKvElA4InVgv81purNRwM",
      "livemode": false,
      "metadata": {
        "RAILS_ENV": "test"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_1QKHpeElA4InVgv8FWy944dm",
      "payment_method_configuration_details": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": ["card"],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 3,
  "request": {
    "id": "req_mDSi3HH25qbhG8",
    "idempotency_key": "<REDACTED>"
  },
  "type": "payment_intent.succeeded"
}
